# LevelAbove Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanViewRange..::..LevelAbove Property
PlanViewRange Class See Also
---
View range for the level above the specified plane
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static ElementId LevelAbove { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LevelAbove As ElementId
	Get
```

Visual C++
---
```text
public:
static property ElementId^ LevelAbove {
	ElementId^ get ();
}
```

# See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace